---
## Front matter
lang: ru-RU
title: 
author: |

institute: |

date: 

## Formatting
toc: false
slide_level: 2
theme: metropolis
header-includes: 

 - '\makeatletter'

 - '\makeatother'
aspectratio: 43
section-titles: true

# Теоретическая справка

рганизуется рекламная кампания нового товара или услуги. Необходимо,
чтобы прибыль будущих продаж с избытком покрывала издержки на рекламу.
Вначале расходы могут превышать прибыль, поскольку лишь малая часть
потенциальных покупателей будет информирована о новинке. Затем, при
увеличении числа продаж, возрастает и прибыль, и, наконец, наступит момент,
когда рынок насытиться, и рекламировать товар станет бесполезным.
Предположим, что торговыми учреждениями реализуется некоторая
продукция, о которой в момент времениt из числа потенциальных покупателейN
знает лишьn покупателей. Для ускорения сбыта продукции запускается реклама
по радио, телевидению и других средств массовой информации. После запуска
рекламной кампании информация о продукции начнет распространяться среди
потенциальных покупателей путем общения друг с другом. Таким образом, после
запуска рекламных объявлений скорость изменения числа знающих о продукции
людей пропорциональна как числу знающих о товаре покупателей, так и числу
покупателей о нем не знающих
Модель рекламной кампании описывается следующими величинами.
Считаем, чтоdn dt - скорость изменения со временем числа потребителей,
узнавших о товаре и готовых его купить,t - время, прошедшее с начала рекламной
кампании,( )n t - число уже информированных клиентов. Эта величина
пропорциональна числу покупателей, еще не знающих о нем, это описывается
следующим образом:1( )(N ( ))t n t

 , гдеN - общее число потенциальных
платежеспособных покупателей,1( ) 0t

 - характеризует интенсивность
рекламной кампании (зависит от затрат на рекламу в данный момент времени).
Помимо этого, узнавшие о товаре потребители также распространяют полученную
информацию среди потенциальных покупателей, не знающих о нем (в этом случае
работает т.н. сарафанное радио). Этот вклад в рекламу описывается величиной2 ( ) ( )(N ( ))t n t n t


, эта величина увеличивается с увеличением потребителей
узнавших о товаре. Математическая модель распространения рекламы описывается
уравнением:



# Выполнение лабораторной работы

Ниже приведены шаги выполнения лабораторной работы, в соответствии с 13 вариантом из приведенного документа.

При выполнении я использовал общий шаблон кода, в котором изменял лишь функции, которые отличают частные случаи от общей модели.

Код 1 случая (рис. [-@fig:001])

![Код 1](image/1.jpg){ #fig:001 width=70% }

График симуляции 1 случая (рис. [-@fig:002])

![График 1](image/2.jpg){ #fig:002 width=70% }

Код 2 случая (рис. [-@fig:003])

![Код 2](image/3.jpg){ #fig:003 width=70% }

График симуляции 2 случая (рис. [-@fig:004])

![График 2](image/4.jpg){ #fig:004 width=70% }

Код 3 случая (рис. [-@fig:005])

![Код 3](image/5.jpg){ #fig:005 width=70% }

График симуляции 3 случая(рис. [-@fig:006])

![График 3](image/6.jpg){ #fig:006 width=70% }
![График 3](image/6.jpg){ #fig:006 width=70% }


## {.standout}

Wer's nicht glaubt, bezahlt einen Taler
